In [11]:
import numpy as np
import pandas as pd

In [249]:
case = {'name':['sandip','prabin','dipesh','sanam'],
                    'y':np.nan,
                    'Exp':[2,1,4,1]
                   }
row_labels=[4,5,6,7]

In [252]:
df = pd.DataFrame(data=case,index=row_labels)
df

     name   y  Exp
4  sandip NaN    2
5  prabin NaN    1
6  dipesh NaN    4
7   sanam NaN    1

In [15]:
df.describe()

             age       Exp
count   4.000000  4.000000
mean   25.000000  2.000000
std     1.825742  1.414214
min    23.000000  1.000000
25%    23.750000  1.000000
50%    25.000000  1.500000
75%    26.250000  2.500000
max    27.000000  4.000000

In [17]:
df.head(n=3)

     name  age  Exp
1  sandip   23    2
2  prabin   24    1
3  dipesh   26    4

In [20]:
df.loc[0:1,'name']

1    sandip
Name: name, dtype: object

In [23]:
df.loc[2:3,'Exp']

2    1
3    4
Name: Exp, dtype: int64

In [31]:
newset = {'name':['sandip','hem','jemin'],'y': np.array([1,2,4]),'exp':'100'}

In [33]:
df = pd.DataFrame(data=newset,index=[1,2,3])
df

     name  y  exp
1  sandip  1  100
2     hem  2  100
3   jemin  4  100

In [36]:
df.loc[1:3,'name']

1    sandip
2       hem
3     jemin
Name: name, dtype: object

In [168]:
df.iloc[1:3,[0,2]]

    name  exp
2    hem  100
3  jemin  100

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   y       3 non-null      int32
 2   exp     3 non-null      object
dtypes: int32(1), object(2)
memory usage: 140.0+ bytes

In [279]:
df.astype(dtype={'exp':np.int32})

KeyError: 'Only a column name can be used for the key in a dtype mappings argument.'

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   y       3 non-null      int32
 2   exp     3 non-null      object
dtypes: int32(1), object(2)
memory usage: 140.0+ bytes

In [278]:
df_= df.astype(dtype = {'exp':np.int32})

KeyError: 'Only a column name can be used for the key in a dtype mappings argument.'

In [48]:
df_.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   y       3 non-null      int32
 2   exp     3 non-null      int32
dtypes: int32(2), object(1)
memory usage: 140.0+ bytes

In [50]:
df_.sort_values(by='y', ascending = False)

     name  y  exp
3   jemin  4  100
2     hem  2  100
1  sandip  1  100

In [51]:
df_.memory_usage()

Index    104
name      12
y         12
exp       12
dtype: int64

In [53]:
df_.shape

(3, 3)

In [54]:
df_.size

9

In [57]:
df_.isna().values.any()

False

In [58]:
df_.isna().count()

name    3
y       3
exp     3
dtype: int64

In [59]:
df_.isna().sum()

name    0
y       0
exp     0
dtype: int64

In [60]:
df_.apply(lambda x:x)

     name  y  exp
1  sandip  1  100
2     hem  2  100
3   jemin  4  100

In [86]:
def names(x):
    return x.iloc[1:3,[0]]

names(df_)

    name
2    hem
3  jemin

In [102]:
df_.apply(lambda x:(x['name']),axis =1)

1    sandip
2       hem
3     jemin
dtype: object

In [97]:
df_.apply(lambda x:calc_num(x['y']),axis = 1)

1     1
2     4
3    16
dtype: int64

In [103]:
def calc_num(sp):
    return np.square(sp)

In [118]:
df_.apply(lambda x:np.square(x) if x.name in [4] else x,axis = 1)

     name  y  exp
1  sandip  1  100
2     hem  2  100
3   jemin  4  100

In [127]:
df_.groupby(['exp'])['y'].sum().reset_index(name='y')

   exp  y
0  100  7

In [134]:
df_.loc[len(df_)] = ['',5,400]

In [135]:
df_.head()

     name  y  exp
1  sandip  1  100
2     hem  2  100
3          5  400

In [158]:
df1=list(filter(lambda x:x%2,df_['y']))

In [159]:
df1

[1, 5]

In [154]:
df2 = df_['exp'].map(lambda x:x - (x*10/100)).reset_index(name='exp')

In [155]:
df2

   index    exp
0      1   90.0
1      2   90.0
2      3  360.0

In [156]:
df3 = df_['exp'].map(lambda x:x%2)

In [157]:
df3

1    0
2    0
3    0
Name: exp, dtype: int64

In [165]:
df_.loc[df_['y']>2]

  name  y  exp
3       5  400

In [170]:
df_.groupby(['y']).agg({'exp':'sum'})

   exp
y
1  100
2  100
5  400

In [172]:
df_.head(n=10).sort_values(by = 'y',ascending = False)

     name  y  exp
3          5  400
2     hem  2  100
1  sandip  1  100

In [244]:
df_.loc[len(df_)]=['sp4',np.nan,10]

SyntaxError: invalid syntax (<ipython-input-244-bad6ba5b1d0d>, line 1)

In [245]:
df_.loc[len(df_)]=['sp2',np.nan,10]

In [181]:
df_.isna().values.any().sum()

1

In [184]:
df_.isna()

    name      y    exp
1  False  False  False
2  False  False  False
3  False   True  False

In [185]:
df_.duplicated()

1    False
2    False
3    False
dtype: bool

In [186]:
df_[df_.duplicated()]

Empty DataFrame
Columns: [name, y, exp]
Index: []

In [288]:
df_.drop_duplicates(keep = 'last', inplace = True)

In [289]:
df_.query("name in ('sandip','hem')")

     name  y  exp
1  sandip  1  100

In [291]:
df_.fillna(value={'y':0})

     name    y  exp
1  sandip  1.0  100
2     sp2  0.0   10

In [246]:
df_

     name    y  exp
1  sandip    1  100
2     sp2  NaN   10

In [200]:
df_.loc[3]

name    {nan, sp, 10}
y       {nan, sp, 10}
exp     {nan, sp, 10}
Name: 3, dtype: object

In [239]:
df_

     name    y  exp
1  sandip    1  100
2     sp4  NaN   10

In [219]:
df_.drop([3],inplace = True)

In [224]:
df_

     name    y  exp
1  sandip    1  100
2      sp  NaN   10

In [247]:
df_.loc[2,'y']

1      1
2    NaN
Name: y, dtype: object

In [254]:
df_.loc[2].fillna(value ={'y':0},inplace = True)

In [265]:
df_

     name    y  exp
1  sandip    1  100
2     sp2  0.0   10

In [273]:
df1.loc[4].fillna(value ={'y':0})
dfs

name    sandip
y          0.0
exp        NaN
Exp        2.0
Name: 4, dtype: object

In [271]:
dfs

name    sandip
y          0.0
exp        NaN
Exp        2.0
Name: 4, dtype: object

In [272]:
df1

     name    y  exp  Exp
1  sandip    1  100  NaN
2     sp2  0.0   10  NaN
4  sandip  NaN  NaN  2.0
5  prabin  NaN  NaN  1.0
6  dipesh  NaN  NaN  4.0
7   sanam  NaN  NaN  1.0